Enums/Renault_РекламацииВиды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_РекламацииВиды</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОшибкаДокументации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Излишек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НевернаяОтгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_РекламацииСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_РекламацииСтатусы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Draft</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Registered</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Returned</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Refreshed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Updated</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Closed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/SAPPR_ВидЗаказаПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>SAPPR_ВидЗаказаПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ZMP1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ZMP2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ZMP4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ZMP8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ZMP9</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_Рекламация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_Рекламация</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Заполняется автоматически перед записью нового документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АктОПоврежденииСТК</Name>
					<Comment>Акт об обнаружении повреждений груза с ТК</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРекламации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_РекламацииВиды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияГруза</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассификацияОтказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_КлассификацияОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестЗафактурованно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестПовреждено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМестПолучено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНормоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийДилера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКоробки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТрН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТрН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетФактура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоврежденноеКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредложениеИнициатора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПредложенияПоРекламациям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_РешенияПоРекламациям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_РекламацииСтатусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SAPPR_ВидЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОВодителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентральныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сообщение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Renault_ПараметрыПодключенияКСервисам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ПараметрыПодключенияКСервисам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Renault_РекламацииСервер/Ext/Module.bsl
Функция ПолучитьВебСервис()
	
	Перем ВебСервис;
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	Адрес = Настройки.АдресWsGate+"ws/RenaultReclamations.1cws?wsdl";
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	ОпределениеСервиса = Новый WSОпределения(Адрес, ЛогинWS, ПарольWS);
	
	Если Renault_ОбщиеФункции.СтараяПлатформа() Тогда
		Выполнить("ВебСервис=Новый WSПрокси(ОпределениеСервиса,""http://renault.ru/WSGate/RenaultReclamations"",""Renault_Reclamations"",""Renault_ReclamationsSoap12"",60)");
	Иначе
		Выполнить("ВебСервис=Новый WSПрокси(ОпределениеСервиса,""http://renault.ru/WSGate/RenaultReclamations"",""Renault_Reclamations"",""Renault_ReclamationsSoap12"",,60)");
	КонецЕсли;	
	
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Возврат ВебСервис;
	
КонецФункции

// Преобразует ссылочные значения для формирования строки JSON
//
// Параметры:
//  Свойство				 - Произвольный - Выгружаемое свойство документа
//  Значение				 - Произвольный - Значение выгружаемого свойства
//  ДополнительныеПараметры	 - Структура 	- Структура дополнительных параметров
//  Отказ					 - Булево 		- Отказ от записи свойств
// 
// Возвращаемое значение:
//  Структура - Структура свойств выгружаемого значения в пределах допустимых типов для формирования строки JSON
//
Функция ПреобразованиеJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	СтруктураСвойств = Новый Структура;
	
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.Номенклатура") Тогда
	
		СтруктураСвойств.Вставить("Артикул", 					Значение.Артикул);

	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда	
		
		СтруктураСвойств.Вставить("ЕдиницаПоКлассификаторуКод", Значение.ЕдиницаПоКлассификатору.Код);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("ПеречислениеСсылка.Renault_РекламацииВиды") Тогда	
		
		ВидРекламацииСтрокой = "";
		
		Если Значение = Перечисления.Renault_РекламацииВиды.Брак Тогда
			ВидРекламацииСтрокой = "Брак";
		ИначеЕсли Значение = Перечисления.Renault_РекламацииВиды.Излишек Тогда	
			ВидРекламацииСтрокой = "Излишек";
		ИначеЕсли Значение = Перечисления.Renault_РекламацииВиды.НевернаяОтгрузка Тогда	
			ВидРекламацииСтрокой = "НевернаяОтгрузка";
		ИначеЕсли Значение = Перечисления.Renault_РекламацииВиды.Недостача Тогда	
			ВидРекламацииСтрокой = "Недостача";
		ИначеЕсли Значение = Перечисления.Renault_РекламацииВиды.ОшибкаДокументации Тогда	
			ВидРекламацииСтрокой = "ОшибкаДокументации";
		КонецЕсли;
		
		СтруктураСвойств.Вставить("ВидРекламацииСтрокой", ВидРекламацииСтрокой);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.CRM_ДилерскиеЦентры") Тогда	
		
		СтруктураСвойств.Вставить("ДилерскийЦентрBIR", Значение.BIR);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.Renault_КлассификацияОтказов") Тогда
		
		СтруктураСвойств.Вставить("КлассификацияОтказовКод", Значение.Код);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("ПеречислениеСсылка.Renault_РекламацииСтатусы") Тогда 	
		
		ТекущийСтатусСтрокой = "";
		
		Если Значение = Перечисления.Renault_РекламацииСтатусы.Draft Тогда
			ТекущийСтатусСтрокой = "Draft";
		ИначеЕсли Значение = Перечисления.Renault_РекламацииСтатусы.Sent Тогда	
			ТекущийСтатусСтрокой = "Sent";
		ИначеЕсли Значение = Перечисления.Renault_РекламацииСтатусы.Registered Тогда	
			ТекущийСтатусСтрокой = "Registered";
		ИначеЕсли Значение = Перечисления.Renault_РекламацииСтатусы.Returned Тогда	
			ТекущийСтатусСтрокой = "Returned";
		ИначеЕсли Значение = Перечисления.Renault_РекламацииСтатусы.Refreshed Тогда	
			ТекущийСтатусСтрокой = "Refreshed";
		ИначеЕсли Значение = Перечисления.Renault_РекламацииСтатусы.Updated Тогда	
			ТекущийСтатусСтрокой = "Updated";
		ИначеЕсли Значение = Перечисления.Renault_РекламацииСтатусы.Closed Тогда	
			ТекущийСтатусСтрокой = "Closed";
		КонецЕсли;
		
		СтруктураСвойств.Вставить("ТекущийСтатусСтрокой", ТекущийСтатусСтрокой);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("ПеречислениеСсылка.SAPPR_ВидЗаказаПоставщику") Тогда
		
		ВидЗаказаПоставщикуСтрокой = "";
		
		Если Значение = Перечисления.SAPPR_ВидЗаказаПоставщику.ZMP1 Тогда
			ВидЗаказаПоставщикуСтрокой = "ZMP1";
		ИначеЕсли Значение = Перечисления.SAPPR_ВидЗаказаПоставщику.ZMP2 Тогда
			ВидЗаказаПоставщикуСтрокой = "ZMP2";
		ИначеЕсли Значение = Перечисления.SAPPR_ВидЗаказаПоставщику.ZMP4 Тогда
			ВидЗаказаПоставщикуСтрокой = "ZMP4";
		ИначеЕсли Значение = Перечисления.SAPPR_ВидЗаказаПоставщику.ZMP8 Тогда
			ВидЗаказаПоставщикуСтрокой = "ZMP8";
		ИначеЕсли Значение = Перечисления.SAPPR_ВидЗаказаПоставщику.ZMP9 Тогда
			ВидЗаказаПоставщикуСтрокой = "ZMP9";
		КонецЕсли;
		
		СтруктураСвойств.Вставить("ВидЗаказаПоставщикуСтрокой", ВидЗаказаПоставщикуСтрокой);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.ТипыЦен") Тогда	
		
		СтруктураСвойств.Вставить("ТипЦенНаименование", Значение.Наименование);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.Renault_ПредложенияПоРекламациям") Тогда
		
		ПредложениеИнициатораСтрокой = "";
		
		Если Значение = Справочники.Renault_ПредложенияПоРекламациям.Возврат Тогда
			ПредложениеИнициатораСтрокой = "Возврат";
		ИначеЕсли Значение = Справочники.Renault_ПредложенияПоРекламациям.Возмещение Тогда
			ПредложениеИнициатораСтрокой = "Возмещение";
		ИначеЕсли Значение = Справочники.Renault_ПредложенияПоРекламациям.Восстановление Тогда
			ПредложениеИнициатораСтрокой = "Восстановление";
		ИначеЕсли Значение = Справочники.Renault_ПредложенияПоРекламациям.Довоз Тогда
			ПредложениеИнициатораСтрокой = "Довоз";
		ИначеЕсли Значение = Справочники.Renault_ПредложенияПоРекламациям.Замена Тогда
			ПредложениеИнициатораСтрокой = "Замена";
		ИначеЕсли Значение = Справочники.Renault_ПредложенияПоРекламациям.ПересортНаСкладеДилера Тогда
			ПредложениеИнициатораСтрокой = "ПересортНаСкладеДилера";
		ИначеЕсли Значение = Справочники.Renault_ПредложенияПоРекламациям.Покупка Тогда
			ПредложениеИнициатораСтрокой = "Покупка";
		КонецЕсли;
		
		СтруктураСвойств.Вставить("ПредложениеИнициатораСтрокой", ПредложениеИнициатораСтрокой);
		
	ИначеЕсли ТипЗнч(Значение) = Тип("ДокументСсылка.Renault_Рекламация") Тогда	
		
		СтруктураСвойств.Вставить("ДатаТН",  Значение.ДатаТН);
		СтруктураСвойств.Вставить("НомерТН", Значение.НомерТН);
		
	Иначе
		
		СтруктураСвойств.Вставить("НетСвойства", "Не прописано");
		
	КонецЕсли;
	
	Возврат СтруктураСвойств;
	
КонецФункции // ПреобразованиеJSON()


////////////////////////////////////////////////////////////////////////////////
// ВЫГРУЗКА v 2.0


// Выгружает данные массива рекламаций
//
// Параметры:
//  МассивРекламаций - Массив - Массив ссылок на документы "Renault_Рекламация"
//  АдресХранилища	 - Строка - Адрес временного хранилища для хранения результата выгрузки
//
Функция ВыгрузитьСинхронно20(МассивРекламаций) Экспорт
	
	СтрокаJSON = СформироватьJSON(МассивРекламаций);
	
	Настройки = Справочники.Renault_ПараметрыПодключенияКСервисам.Orders;
	HTTPСоединение = Новый HTTPСоединение(Настройки.АдресСервера,, Настройки.Логин, Настройки.Пароль);
	HTTPЗапрос = Новый HTTPЗапрос(Настройки.ИмяСервиса + "v1/upload");

	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(ТекстОтвета);
	
	СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	
	РезультатВыполнения = Новый Структура;
	
	Если СтруктураОтвета.ReturnCode = "H000" Тогда
		РезультатВыполнения.Вставить("ЗавершенУспешно", Истина);
		РезультатВыполнения.Вставить("Номер", СтруктураОтвета.Number);
	Иначе                                                        
		РезультатВыполнения.Вставить("ЗавершенУспешно", Ложь);
		ОписаниеОшибок = СтруктураОтвета.ReturnCode + ": ";
		Если СтруктураОтвета.ReturnCode = "H002" Тогда
			ОписаниеОшибок = ОписаниеОшибок + "Неверный формат JSON";
		Иначе
			ОписаниеОшибок = ОписаниеОшибок + СтруктураОтвета.Description;
		КонецЕсли;
		РезультатВыполнения.Вставить("ОписаниеОшибок", ОписаниеОшибок);
	КонецЕсли;

	
	Возврат РезультатВыполнения;
	
КонецФункции // Выгрузить20()

// Формирует строку JSON для выгрузки рекламаций
//
// Параметры:
//  МассивРекламаций - Массив - Массив ссылок на документы "Renault_Рекламация"
// 
// Возвращаемое значение:
//  Строка - Сформированная строка JSON
//
Функция СформироватьJSON(МассивРекламаций)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рекламация.Ссылка КАК Ссылка,
	|	Рекламация.Номер КАК НомерДокДилера,
	|	Рекламация.Дата КАК ДатаДокДилера,
	|	Рекламация.Автор.Наименование КАК АвторДилера,
	|	Рекламация.АктОПоврежденииСТК КАК АктОПоврежденииСТК,
	|	Рекламация.ВидРекламации КАК ВидРекламации,
	|	Рекламация.ДатаТН КАК ДатаТН,
	|	Рекламация.ДатаПолученияГруза КАК ДатаПолученияГруза,
	|	Рекламация.ДатаПринятияРешения КАК ДатаПринятияРешения,
	|	Рекламация.КлассификацияОтказов КАК КлассификацияОтказов,
	|	Рекламация.Количество КАК Количество,
	|	Рекламация.КоличествоМестЗафактурованно КАК КоличествоМестЗафактурованно,
	|	Рекламация.КоличествоМестПовреждено КАК КоличествоМестПовреждено,
	|	Рекламация.КоличествоМестПолучено КАК КоличествоМестПолучено,
	|	Рекламация.КоличествоПлан КАК КоличествоПлан,
	|	Рекламация.КомментарийДилера КАК КомментарийДилера,
	|	Рекламация.Номенклатура КАК Номенклатура,
	|	Рекламация.НоменклатураПлан КАК НоменклатураПлан,
	|	Рекламация.ДилерскийЦентр.BIR КАК НомерДилера,
	|	Рекламация.НомерТН КАК НомерТН,
	|	Рекламация.НомерКоробки КАК НомерКоробки,
	|	Рекламация.НомерМеста КАК НомерМеста,
	|	Рекламация.ДатаТрН КАК ДатаТрН,
	|	Рекламация.НомерТрН КАК НомерТрН,
	|	Рекламация.СчетФактура КАК СчетФактура,
	|	Рекламация.ПоврежденноеКоличество КАК РекламируемоеКоличество,
	|	Рекламация.ПредложениеИнициатора КАК ПредложениеИнициатора,
	|	Рекламация.Сумма КАК Сумма,
	|	Рекламация.СуммаПлан КАК СуммаПлан,
	|	Рекламация.ТипЗаказа КАК ТипЗаказа,
	|	Рекламация.ФИОВодителя КАК ФИОВодителя,
	|	Рекламация.Цена КАК Цена,
	|	Рекламация.ЦенаПлан КАК ЦенаПлан,
	|	Рекламация.ЭлектронныйАдрес КАК ЭлектронныйАдрес,
	|	Рекламация.ЦентральныйНомер КАК ЦентральныйНомер,
	|	Рекламация.VIN КАК VIN,
	|	Рекламация.РегистрационныйНомер КАК РегистрационныйНомер
	|ИЗ
	|	Документ.Renault_Рекламация КАК Рекламация
	|ГДЕ
	|	Рекламация.Ссылка В(&МассивРекламаций)
	|	И НЕ Рекламация.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("МассивРекламаций", МассивРекламаций);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	СтруктураДанных = Новый Структура;
	Для Каждого ТекущаяКолонка Из ТаблицаДанных.Колонки Цикл
		СтруктураДанных.Вставить(ТекущаяКолонка.Имя);
	КонецЦикла;
	
	СтруктураДанных.Вставить("Фотографии");
		
	ЗаписьJSON = Новый ЗаписьJSON;
	
	Для Каждого СтрокаДанных Из ТаблицаДанных Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаДанных);
		ДобавитьФотографииJSON(СтруктураДанных, СтрокаДанных.Ссылка);
		
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураДанных,, "ПреобразованиеJSON", Renault_РекламацииСервер);
		
	КонецЦикла;
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции // СформироватьJSON()	

// Добавляет информацию о прикрепленных фотографиях в структуру данных для формата JSON
//
// Параметры:
//  СтруктураДанных	 - Структура 							- Структура данных для формата JSON
//  Рекламация		 - ДокументСсылка.Renault_Рекламация	- Выгружаемый документ
//
Процедура ДобавитьФотографииJSON(СтруктураДанных, Рекламация)
	
	МассивФотографий = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КартинкиИФайлы.Идентификатор,
	|	КартинкиИФайлы.ИмяФайла,
	|	КартинкиИФайлы.ДатаСохранения,
	|	КартинкиИФайлы.Комментарий,
	|	КартинкиИФайлы.Данные КАК ХранилищеДанных
	|ИЗ
	|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
	|ГДЕ
	|	КартинкиИФайлы.Объект = &Рекламация";
	Запрос.УстановитьПараметр("Рекламация", Рекламация);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураФотографии = Новый Структура("Идентификатор, ИмяФайла, ДатаСохранения, Комментарий, Base64Фотография");
			
			ЗаполнитьЗначенияСвойств(СтруктураФотографии, Выборка);
			ДвоичныеДанныеФотографии = Выборка.ХранилищеДанных.Получить();
			СтруктураФотографии.Вставить("Base64Фотография", Base64Строка(ДвоичныеДанныеФотографии));
			МассивФотографий.Добавить(СтруктураФотографии);
			
		КонецЦикла;
		
	КонецЕсли;
		
	СтруктураДанных.Фотографии = МассивФотографий;
	
КонецПроцедуры // ДобавитьФотографииJSON()



Функция СформироватьJSONКомментарий(Номер, Комментарий)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, Новый Структура("Номер,Сообщение", Номер, Комментарий));

	Возврат ЗаписьJSON.Закрыть();

КонецФункции

// Добавляет комментарий к рекламации
//
Функция ВыгрузитьКомментарий(Номер, Комментарий) Экспорт

	ТекстЗапроса = СформироватьJSONКомментарий(Номер, Комментарий);

	Настройки = Справочники.Renault_ПараметрыПодключенияКСервисам.Orders;
	HTTPСоединение = Новый HTTPСоединение(Настройки.АдресСервера,, Настройки.Логин, Настройки.Пароль);
	HTTPЗапрос = Новый HTTPЗапрос(Настройки.ИмяСервиса + "v1/comment");

	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);

	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();

	ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(ТекстОтвета);
	СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);

	РезультатВыполнения = Новый Структура;

	Если СтруктураОтвета.ReturnCode = "H000" Тогда
		РезультатВыполнения.Вставить("ЗавершенУспешно", Истина);
	Иначе                                                  
		РезультатВыполнения.Вставить("ЗавершенУспешно", Ложь);
		РезультатВыполнения.Вставить("ОписаниеОшибок", СтруктураОтвета.Description);
	КонецЕсли;

	Возврат РезультатВыполнения;

КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБНОВЛЕНИЕ v 2.0

Процедура ОбновитьСтатусыРекламаций(Параметр=Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_Рекламация.ДилерскийЦентр КАК ДилерскийЦентр,
	               |	Renault_Рекламация.Номер,
	               |	Renault_Рекламация.ЦентральныйНомер
	               |ИЗ
	               |	Документ.Renault_Рекламация КАК Renault_Рекламация
	               |ГДЕ
	               |	НЕ Renault_Рекламация.ТекущийСтатус В (ЗНАЧЕНИЕ(Перечисление.Renault_РекламацииСтатусы.Closed), ЗНАЧЕНИЕ(Перечисление.Renault_РекламацииСтатусы.Returned), ЗНАЧЕНИЕ(Перечисление.Renault_РекламацииСтатусы.Draft))
	               |ИТОГИ ПО
	               |	ДилерскийЦентр";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДилеров = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДилеров.Следующий() Цикл
		
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("ДилерскийЦентр", ВыборкаДилеров.ДилерскийЦентр.BIR);
		МассивРекламаций = Новый Массив;

		ВыборкаРекламаций = ВыборкаДилеров.Выбрать();
		Пока ВыборкаРекламаций.Следующий() Цикл
			МассивРекламаций.Добавить(ВыборкаРекламаций.ЦентральныйНомер);
		КонецЦикла;

		СтруктураЗапроса.Вставить("Рекламации", МассивРекламаций);
		

		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Настройки = Справочники.Renault_ПараметрыПодключенияКСервисам.Orders;
		HTTPСоединение = Новый HTTPСоединение(Настройки.АдресСервера,, Настройки.Логин, Настройки.Пароль);
		HTTPЗапрос = Новый HTTPЗапрос(Настройки.ИмяСервиса + "v1/status");
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();

		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстОтвета);

		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON,,"Дата");

		Для Каждого Рек Из СтруктураОтвета.Рекламации Цикл

			Рекламация = Документы.Renault_Рекламация.НайтиПоРеквизиту("ЦентральныйНомер", Рек.Номер);
			Статус = Перечисления.Renault_РекламацииСтатусы[Рек.Статус];

			Если Рекламация.ТекущийСтатус <> Статус Тогда

				РекламацияОбъект = Рекламация.ПолучитьОбъект();	
				РекламацияОбъект.ТекущийСтатус = Статус;
				РекламацияОбъект.ОписаниеРешения      = Рек.ОписаниеРешения;
				РекламацияОбъект.СуммаВозмещения      = Рек.СуммаВозмещения;
				РекламацияОбъект.ДатаПринятияРешения  = Рек.ДатаПринятияРешения;
				РекламацияОбъект.КоличествоНормоЧасов = Рек.КоличествоНормоЧасов;
				РекламацияОбъект.Решение			  = НайтиРешениеРекламации(СокрЛП(Рек.Решение)); // DMSREN-297 23.09.2019

				РекламацияОбъект.Сообщения.Очистить();
				Для Каждого Сообщение Из Рек.Сообщения Цикл
					Стр = РекламацияОбъект.Сообщения.Добавить();
					Стр.Дата         = Сообщение.Дата;
					Стр.Пользователь = Сообщение.Пользователь;
					Стр.Сообщение    = Сообщение.Сообщение;
				КонецЦикла;

				РекламацияОбъект.Записать();

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

// НАЧАЛО DMSREN-297 24.09.2019
Функция НайтиРешениеРекламации(РешениеСтр)
	
	РешениеСпр = Справочники.Renault_РешенияПоРекламациям.НайтиПоНаименованию(РешениеСтр);
	
	Если НЕ ЗначениеЗаполнено(РешениеСпр) Тогда
		
		лРешение = Справочники.Renault_РешенияПоРекламациям.СоздатьЭлемент();
		лРешение.Наименование = РешениеСтр;
		лРешение.ПолноеНаименование = РешениеСтр;
		
		Попытка
			лРешение.Записать();
			РешениеСпр = лРешение.Ссылка;
		Исключение
			Информация = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Запись решения по рекламациям", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Renault_РешенияПоРекламациям, ПодробноеПредставлениеОшибки(Информация));
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат РешениеСпр;
	
КонецФункции
// КОНЕЦ DMSREN-297 24.09.2019
